XJU-Hurricane/STM32_Template/Little/f103/Drivers/bsp/Src/uart.c
/*******************************************************************************
 * @defgroup 串口4
 * @{
 */

#ifdef EN_UART4
UART_HandleTypeDef g_uart4_handle = {0};
#if EN_UART4_RX
#if !UART4_USE_DMA_RX
uint8_t g_uart4_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_uart4_rx_status = 0;
static uint8_t g_uart4_recv_buf[RECV_IT_BUF_SIZE];
#endif /* !UART4_USE_DMA_RX */
/**
 * @brief 串口4中断服务函数
 */
void UART4_IRQHandler(void) {
#if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
#endif /* SYS_SUPPORT_OS */

#if UART4_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&g_uart4_handle, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&g_uart4_handle);
        uart_dmarx_idle_callback(&g_uart4_handle);
    }
#endif /* UART4_USE_IDLE_IT */

    HAL_UART_IRQHandler(&g_uart4_handle); /* 调用HAL库中断处理公用函数 */

#if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
#endif /* SYS_SUPPORT_OS */
}
#endif /* EN_UART4_RX */
/**
 * @brief 串口4初始化
 * @param bound 波特率
 */
void uart4_init(uint32_t bound) {
    g_uart4_handle.Instance = UART4;
    g_uart4_handle.Init.BaudRate = bound;
    g_uart4_handle.Init.WordLength = UART_WORDLENGTH_8B;
    g_uart4_handle.Init.StopBits = UART_STOPBITS_1;
    g_uart4_handle.Init.Parity = UART_PARITY_NONE;
    g_uart4_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_uart4_handle.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&g_uart4_handle);

#if UART4_USE_DMA_TX
    /* 打开DMA发送 */
    uart4_dmatx_init(2048, 128);
#endif /* UART4_USE_DMA_TX */

#if EN_UART4_RX
#if UART4_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    uart4_dmarx_init(4096, 128);
#else  /* UART4_USE_DMA_RX */
    HAL_UART_Receive_IT(&g_uart4_handle, (uint8_t *)g_uart4_recv_buf,
                        RECV_IT_BUF_SIZE);
#endif /* UART4_USE_DMA_RX */
#endif /* EN_UART4_RX */
}
#endif /* EN_UART4 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口5
 * @{
 */

#ifdef EN_UART5
UART_HandleTypeDef g_uart5_handle = {0};
#if EN_UART5_RX
uint8_t g_uart5_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_uart5_rx_status = 0;
static uint8_t g_uart5_recv_buf[RECV_IT_BUF_SIZE];
/**
 * @brief 串口5中断服务函数
 */
void UART5_IRQHandler(void) {
#if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
#endif /* SYS_SUPPORT_OS */

    HAL_UART_IRQHandler(&g_uart5_handle); /* 调用HAL库中断处理公用函数 */

#if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
#endif /* SYS_SUPPORT_OS */
}
#endif /* EN_UART5_RX */
/**
 * @brief 串口5初始化
 * @param bound 波特率
 */
void uart5_init(uint32_t bound) {
    g_uart5_handle.Instance = UART5;
    g_uart5_handle.Init.BaudRate = bound;
    g_uart5_handle.Init.WordLength = UART_WORDLENGTH_8B;
    g_uart5_handle.Init.StopBits = UART_STOPBITS_1;
    g_uart5_handle.Init.Parity = UART_PARITY_NONE;
    g_uart5_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_uart5_handle.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&g_uart5_handle);
#if EN_UART5_RX
    HAL_UART_Receive_IT(&g_uart5_handle, (uint8_t *)g_uart5_recv_buf,
                        RECV_IT_BUF_SIZE);
#endif /* EN_UART5_RX */
}
#endif /* EN_UART5 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 公共处理函数
 * @{
 */

/**
 * @brief 串口底层驱动
 *
 * @param huart 串口句柄
 */
void HAL_UART_MspInit(UART_HandleTypeDef *huart) {
    GPIO_InitTypeDef gpio_initure = {0};
    if (huart->Instance == USART1) {
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_USART1_CLK_ENABLE();
        __HAL_RCC_AFIO_CLK_ENABLE();

        gpio_initure.Pin = GPIO_PIN_9;
        gpio_initure.Mode = GPIO_MODE_AF_PP;
        gpio_initure.Pull = GPIO_PULLUP;
        gpio_initure.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(GPIOA, &gpio_initure); /* PA9 */
        gpio_initure.Pin = GPIO_PIN_10;
        gpio_initure.Mode = GPIO_MODE_INPUT;
        HAL_GPIO_Init(GPIOA, &gpio_initure); /* PA10 */
#if EN_USART1_RX
        HAL_NVIC_EnableIRQ(USART1_IRQn);
        HAL_NVIC_SetPriority(USART1_IRQn, 2, 2);
#endif /* EN_USART1_RX */
    } else if (huart->Instance == USART2) {
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_USART2_CLK_ENABLE();
        __HAL_RCC_AFIO_CLK_ENABLE();

        gpio_initure.Pin = GPIO_PIN_2;
        gpio_initure.Mode = GPIO_MODE_AF_PP;
        gpio_initure.Pull = GPIO_PULLUP;
        gpio_initure.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(GPIOA, &gpio_initure); /* PA2 */
        gpio_initure.Pin = GPIO_PIN_3;
        gpio_initure.Mode = GPIO_MODE_INPUT;
        HAL_GPIO_Init(GPIOA, &gpio_initure); /* PA3 */
#if EN_USART2_RX
        HAL_NVIC_EnableIRQ(USART2_IRQn);
        HAL_NVIC_SetPriority(USART2_IRQn, 2, 2);
#endif /* EN_USART2_RX */
    } else if (huart->Instance == USART3) {
        __HAL_RCC_GPIOB_CLK_ENABLE();
        __HAL_RCC_USART3_CLK_ENABLE();
        __HAL_RCC_AFIO_CLK_ENABLE();

        gpio_initure.Pin = GPIO_PIN_10;
        gpio_initure.Mode = GPIO_MODE_AF_PP;
        gpio_initure.Pull = GPIO_PULLUP;
        gpio_initure.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(GPIOB, &gpio_initure); /* PB10 */
        gpio_initure.Pin = GPIO_PIN_11;
        gpio_initure.Mode = GPIO_MODE_INPUT;
        HAL_GPIO_Init(GPIOB, &gpio_initure); /* PB11 */
#if EN_USART3_RX
        HAL_NVIC_EnableIRQ(USART3_IRQn);
        HAL_NVIC_SetPriority(USART3_IRQn, 2, 2);
#endif /* EN_USART3_RX */
    } else if (huart->Instance == UART4) {
        __HAL_RCC_GPIOC_CLK_ENABLE();
        __HAL_RCC_UART4_CLK_ENABLE();
        __HAL_RCC_AFIO_CLK_ENABLE();

        gpio_initure.Pin = GPIO_PIN_10;
        gpio_initure.Mode = GPIO_MODE_AF_PP;
        gpio_initure.Pull = GPIO_PULLUP;
        gpio_initure.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(GPIOC, &gpio_initure); /* PC10 */
        gpio_initure.Pin = GPIO_PIN_11;
        gpio_initure.Mode = GPIO_MODE_INPUT;
        HAL_GPIO_Init(GPIOC, &gpio_initure); /* PC11 */
#if EN_UART4_RX
        HAL_NVIC_EnableIRQ(UART4_IRQn);
        HAL_NVIC_SetPriority(UART4_IRQn, 2, 2);
#endif /* EN_UART4_RX */
    } else if (huart->Instance == UART5) {
        __HAL_RCC_GPIOC_CLK_ENABLE();
        __HAL_RCC_GPIOD_CLK_ENABLE();
        __HAL_RCC_UART5_CLK_ENABLE();
        __HAL_RCC_AFIO_CLK_ENABLE();

