XJU-Hurricane/STM32_Template/Little/f103/Drivers/bsp/Src/uart.c
        gpio_initure.Pin = GPIO_PIN_12;
        gpio_initure.Mode = GPIO_MODE_AF_PP;
        gpio_initure.Pull = GPIO_PULLUP;
        gpio_initure.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(GPIOC, &gpio_initure); /* PC12 */
        gpio_initure.Pin = GPIO_PIN_2;
        gpio_initure.Mode = GPIO_MODE_INPUT;
        HAL_GPIO_Init(GPIOD, &gpio_initure); /* PD2 */
#if EN_UART5_RX
        HAL_NVIC_EnableIRQ(UART5_IRQn);
        HAL_NVIC_SetPriority(UART5_IRQn, 2, 2);
#endif /* EN_UART5_RX */
    }
}

/**
 * @brief 串口发送完成回调
 *
 * @param huart 串口句柄
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart) {
    uart_dmatx_clear_tc_flag(huart);
}

/**
 * @brief 串口接收完成回调
 *
 * @param huart 串口句柄
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
    /* 如果要使用某个串口的接收中断,请在头文件定义 */
    if (huart->Instance == USART1) {
#if EN_USART1_RX
#if !USART1_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((g_usart1_rx_status & 0x8000) == 0) {
            /* 接收未完成 */
            if (g_usart1_rx_status & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_usart1_recv_it_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    g_usart1_rx_status = 0; /* 接收错误,重新开始 */
                } else {
                    g_usart1_rx_status |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_usart1_recv_it_buf[0] == 0x0d) {
                    g_usart1_rx_status |= 0x4000;
                } else {
                    g_usart1_rx_buf[g_usart1_rx_status & 0X3FFF] =
                        g_usart1_recv_it_buf[0];
                    g_usart1_rx_status++;
                    if (g_usart1_rx_status > (USART_REC_LEN - 1)) {
                        g_usart1_rx_status = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&g_usart1_handle, (uint8_t *)g_usart1_recv_it_buf,
                            RECV_IT_BUF_SIZE);
#else  /* !USART1_USE_DMA_RX */
        uart_dmarx_done_callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
#endif /* !USART1_USE_DMA_RX */
#endif /* EN_USART1_RX */
    } else if (huart->Instance == USART2) {
#if EN_USART2_RX
#if !USART2_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((g_usart2_rx_status & 0x8000) == 0) {
            /* 接收未完成 */
            if (g_usart2_rx_status & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_usart2_recv_it_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    g_usart2_rx_status = 0; /* 接收错误,重新开始 */
                } else {
                    g_usart2_rx_status |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_usart2_recv_it_buf[0] == 0x0d) {
                    g_usart2_rx_status |= 0x4000;
                } else {
                    g_usart2_rx_buf[g_usart2_rx_status & 0X3FFF] =
                        g_usart2_recv_it_buf[0];
                    g_usart2_rx_status++;
                    if (g_usart2_rx_status > (USART_REC_LEN - 1)) {
                        g_usart2_rx_status = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&g_usart2_handle, (uint8_t *)g_usart2_recv_it_buf,
                            RECV_IT_BUF_SIZE);
#else  /* !USART2_USE_DMA_RX */
        uart_dmarx_done_callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
#endif /* !USART2_USE_DMA_RX */
#endif /* EN_USART2_RX */
    } else if (huart->Instance == USART3) {
#if EN_USART3_RX
#if !USART3_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((g_usart3_rx_status & 0x8000) == 0) {
            /* 接收未完成 */
            if (g_usart3_rx_status & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_usart3_recv_it_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    g_usart3_rx_status = 0; /* 接收错误,重新开始 */
                } else {
                    g_usart3_rx_status |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_usart3_recv_it_buf[0] == 0x0d) {
                    g_usart3_rx_status |= 0x4000;
                } else {
                    g_usart3_rx_buf[g_usart3_rx_status & 0X3FFF] =
                        g_usart3_recv_it_buf[0];
                    g_usart3_rx_status++;
                    if (g_usart3_rx_status > (USART_REC_LEN - 1)) {
                        g_usart3_rx_status = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&g_usart3_handle, (uint8_t *)g_usart3_recv_it_buf,
                            RECV_IT_BUF_SIZE);
#else  /* !USART3_USE_DMA_RX */
        uart_dmarx_done_callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
#endif /* !USART3_USE_DMA_RX */
#endif /* EN_USART3_RX */
    } else if (huart->Instance == UART4) {
#if EN_UART4_RX
#if !UART4_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((g_uart4_rx_status & 0x8000) == 0) {
            /* 接收未完成 */
            if (g_uart4_rx_status & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_uart4_recv_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    g_uart4_rx_status = 0; /* 接收错误,重新开始 */
                } else {
                    g_uart4_rx_status |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_uart4_recv_buf[0] == 0x0d) {
                    g_uart4_rx_status |= 0x4000;
                } else {
                    g_uart4_rx_buf[g_uart4_rx_status & 0X3FFF] =
                        g_uart4_recv_buf[0];
                    g_uart4_rx_status++;
                    if (g_uart4_rx_status > (USART_REC_LEN - 1)) {
                        g_uart4_rx_status = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&g_uart4_handle, (uint8_t *)g_uart4_recv_buf,
                            RECV_IT_BUF_SIZE);
#else  /* !UART4_USE_DMA_RX */
        uart_dmarx_done_callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
#endif /* !UART4_USE_DMA_RX */
#endif /* EN_UART4_RX */
    } else if (huart->Instance == UART5) {
#if EN_UART5_RX
        if ((g_uart5_rx_status & 0x8000) == 0) {
            /* 接收未完成 */
            if (g_uart5_rx_status & 0x4000) {
                /* 接收到了0x0d */
                if (g_uart5_recv_buf[0] != 0x0a) {
                    g_uart5_rx_status = 0; /* 接收错误,重新开始 */
                } else {
                    g_uart5_rx_status |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0X0D */
                if (g_uart5_recv_buf[0] == 0x0d) {
                    g_uart5_rx_status |= 0x4000;
                } else {
                    g_uart5_rx_buf[g_uart5_rx_status & 0X3FFF] =
                        g_uart5_recv_buf[0];
                    g_uart5_rx_status++;
                    if (g_uart5_rx_status > (USART_REC_LEN - 1)) {
                        g_uart5_rx_status = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
            HAL_UART_Receive_IT(&g_uart5_handle, (uint8_t *)g_uart5_recv_buf,
                                RECV_IT_BUF_SIZE);
        }
#endif /* EN_UART5_RX */
    }
}

/**
 * @brief 串口接收半满回调
 *
 * @param huart 串口句柄
 */
void HAL_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart) {
    uart_dmarx_halfdone_callback(huart);
}

/**
 * @brief 串口错误回调
 *
 * @param huart 串口句柄
 */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart) {
    __IO uint32_t tmpErr = 0x00U;

    tmpErr = HAL_UART_GetError(huart);
    if (HAL_UART_ERROR_NONE == tmpErr) {
        return;
    }

    switch (tmpErr) {
        case HAL_UART_ERROR_PE:
            __HAL_UART_CLEAR_PEFLAG(huart);
            break;
        case HAL_UART_ERROR_NE:
            __HAL_UART_CLEAR_NEFLAG(huart);
            break;
        case HAL_UART_ERROR_FE:
            __HAL_UART_CLEAR_FEFLAG(huart);
            break;
        case HAL_UART_ERROR_ORE:
            __HAL_UART_CLEAR_OREFLAG(huart);
            break;
        case HAL_UART_ERROR_DMA:

            break;
        default:
            break;
    }

    if (NULL != huart->hdmarx) {
        while (
            HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr, huart->RxXferSize)) {
            __HAL_UNLOCK(huart);
        }
    } else {
        /* 恢复接收地址指针到初始 buffer 位置 ，初始地址 = 当前地址 -
         * 已接收的数据个数，已接收的数据个数 = 需要接收数 - 还未接收数*/
        while (HAL_UART_Receive_IT(
            huart, huart->pRxBuffPtr - (huart->RxXferSize - huart->RxXferCount),
            huart->RxXferSize)) {
            __HAL_UNLOCK(huart);
        }
    }
}

/**
 * @brief 指定串口输出
 * @param huart 串口句柄指针
 * @param __format 欲输出的内容, 类似于printf格式
 */
void uart_print(UART_HandleTypeDef *huart, const char *__format, ...) {
    int len;
    va_list ap;
    va_start(ap, __format);

    /* 清空发送缓冲区 */
    memset(g_uart_tx_buf, 0x0, TX_BUF_LEN);

    /* 填充发送缓冲区 */
    vsnprintf((char *)g_uart_tx_buf, TX_BUF_LEN, (const char *)__format, ap);
    va_end(ap);
    len = strlen((const char *)g_uart_tx_buf);

    /* 往串口发送数据 */
    HAL_UART_Transmit(huart, (uint8_t *)&g_uart_tx_buf, (uint16_t)len, 0xFFFF);
}

/**
 * @}
 */

